Repository: Prodeko/prodeko-org-djangocms
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: High school student page
fi: Abisivut

source: The two password fields didn't match.
fi: Salasanat eivät täsmää.

source: Password
fi: Salasana

source: Password confirmation
fi: Uusi salasana - vahvistus

source: Enter the same password as before, for verification.
fi: Vahvista antamalla sama salasana.

source: Your old password was entered incorrectly. Please enter it again.
fi: Salasana on väärä. Yritä uudestaan.

source: Old password
fi: Vanha salasana

source: New password
fi: Uusi salasana

source: New password confirmation
fi: Uusi salasana - vahvistus

source: Personal info
fi: Henkilökohtainen tieto

source: Permissions
fi: Oikeudet

source: Important dates
fi: Tärkeitä päivämääriä

source: Prodeko authentication
fi: Prodeko kirjautuminen

source: Incorrect password
fi: Väärä salasana

source: Passwords don't match
fi: Salasanat eivät täsmää

source: email address
fi: sähköposti

source: Accepted privacy policy
fi: Hyväksynyt tietosuojalausekkeen

source: Designates whether the user has accepted Prodeko's privacy policy.
fi: Määrittää, onko käyttäjä hyväksynyt Prodekon tietosuojalausekkeen.

source: user
fi: käyttäjä

source: Users
fi: Käyttäjät

source: Profile
fi: Profiili

source: Name
fi: Nimi

source: Email
fi: Sähköposti

source: Edit profile
fi: Muokkaa profiilia

source: New Password
fi: Uusi salasana

source: Confirm New Password
fi: Vahvista Uusi salasana

source: Current Password
fi: Nykyinen Salasana

source: Save changes
fi: Tallenna muutokset

source: Your password has been set. You may go ahead and Sign in now.
fi: Salasanasi on asetettu. Voit kirjautua nyt sisään.

source: Back to login
fi: Takaisin kirjautumiseen

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
fi: Salasanan nollauslinkki viallinen - se on mahdollisesti käytetty. Pyydä uutta salasanan nollausta.

source: Go back to the website
fi: Mene takaisin sivustolle

source: Change password
fi: Vaihda salasana

source: We've emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
fi: Olemme lähettäneet ohjeet salasanan asettamiseksi kirjoittamaasi sähköpostiosoitteeseen.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
fi: Jos et saanut sähköpostia, varmista että kirjoitit sähköpostiosoitteen jolla rekisteröidyit. Tarkista lisäksi spam-kansio.

source: Go back to login
fi: Takaisin kirjautumiseen

source: You have requested a password reset for
fi: Olet resetoimassa käyttäjän

source: account at prodeko.org
fi: salasanaa prodeko.org sivulle.

source: Please go to the following page and choose a new password:
fi: Vaihda salasana tästä linkistä:

source: Submit
fi: Lähetä

source: Login
fi: Kirjaudu

source: Password forgotten?
fi: Salasana unohtunut?

source: The email and password didn't match. Try again
fi: Sähköposti ja salasana eivät täsmänneet. Yritä uudestaan

source: Lifelong learning page
fi: Lifelong learning sivu

source: name
fi: nimi

source: coaches
fi: valmentajat

source: description
fi: kuvaus

source: registration url
fi: ilmoittautumislinkki

source: banner image
fi: kuva

source: group size
fi: kurssin koko

source: timing
fi: ajankohta

source: open
fi: auki

source: course
fi: kurssi

source: Courses
fi: Kurssit

source: year
fi: Vuosi

source: Contact form
fi: Yhteydenottolomake

source: Contact form application
fi: Sovellus - Yhteydenottolomake

source: Optional. Fill if you want to be contacted back.
fi: Vapaaehtoinen. Täytä mikäli haluat vastauksen viestiisi.

source: Feedback and general questions (hallitus@prodeko.org)
fi: Palaute ja yleiset asiat (hallitus@prodeko.org)

source: PTER (Prodekoian activities encouragement fund) grants (hallitus@prodeko.org)
fi: PTER (Prodekolaistoiminnan edistämisrahasto) hakemukset (hallitus@prodeko.org)

source: Alumni, department and stakeholder relations (puheenjohtaja@prodeko.org)
fi: Alumni-, laitos- ja muut sidosryhmäsuhteet (puheenjohtaja@prodeko.org)

source: Cooperation with fellow guilds (ulkoministeri@prodeko.org)
fi: Yhteistyö ja yhteistyöpyynnöt toisten kiltojen ja ainejärjestöjen kanssa (ulkoministeri@prodeko.org)

source: Marketing to high school students and questions relating applying (abivastaava@prodeko.org)
fi: Abimarkkinointi ja hakeminen opiskelijaksi

source: New students, freshmen events and education (fuksikapteeni@prodeko.org)
fi: Uudet opiskelijat, fuksitapahtumat, opiskelun aloittaminen (fuksikapteeni@prodeko.org)

source: Master and exchange students (maisterikvkapteeni@prodeko.org)
fi: Maisteri- ja vaihto-opiskelijat (maisterikvkapteeni@prodeko.org)

source: Communications, email lists and brand (mediakeisari@prodeko.org)
fi: Jäsenistölle tiedottaminen, sähköpostilistat, brändi ja viestintä (mediakeisari@prodeko.org)

source: IT related questions (cto@prodeko.org)
fi: Tietotekniset kysymykset (cto@prodeko.org)

source: Corporate Relations (yrityssuhdevastaava@prodeko.org)
fi: Yrityssuhteet (yrityssuhdevastaava@prodeko.org)

source: Excursions (excumestari@prodeko.org)
fi: Excursiot (excumestari@prodeko.org)

source: Student events (sisakumi@prodeko.org)
fi: Tapahtumat, tapahtumaehdotukset (sisakumi@prodeko.org)

source: Billing and finances (rahastonhoitaja@prodeko.org)
fi: Laskut, kulukorvaukset, raha-asiat (rahastonhoitaja@prodeko.org)

source: Tutoring (isovastaava@prodeko.org)
fi: ISO-toiminta (isovastaava@prodeko.org)

source: Created at
fi: Luotu

source: Who do you wish to contact?
fi: Keneen haluat olla yhteydessä?

source: Your message
fi: Viestisi

source: I accept that my email address is stored in order to be contacted regarding my message.
fi: Hyväksyn sähköpostiosoitteeni tallentamisen, jotta viestiini voidaan vastata.

source: contact form application
fi: yhteydenottolomake

source: Contact us
fi: Ota yhteyttä

source: If you don't agree with Prodeko's privacy policy you can't use this online contact form. You can reach us also by regular email.
fi: Mikäli et hyväksy Prodekon tietosuojakäytäntöä, et voi käyttää yhteydenottolomaketta. Voit ottaa yhteyttä myös sähköpostitse.

source: 📬 Your message has been received!
fi: 📬 Viesti vastaanotettu!

source: ⚠️ Something went wrong. Contact mediakeisari@prodeko.org or send your message directly via email.
fi: ️⚠️ Jotakin meni pieleen. Ota yhteyttä sähköpostitse.

source: Privacy policy
fi: Tietosuoja

source: /privacy-policy
fi: /tietosuoja

source: Infoscreen
fi: Infoscreeni

source: title
fi: otsikko

source: start datetime
fi: alkamispäivä

source: end datetime
fi: päättymispäivä

source: highlight
fi: korosta

source: visible
fi: näkyvissä

source: Guild room camera
fi: Kiltiskamera

source: Guild room camera application
fi: Sovellus - Kiltiskamera

source: Status
fi: Tila

source: New
fi: Uudet

source: In Process
fi: Käsittelyssä

source: Processed
fi: Valmis

source: Reimbursements
fi: Kulukorvaukset

source: Reimbursement form application
fi: Sovellus - Kulukorvauslomake

source: e.g. "Food expenses", "Coffee to the guildroom" or "Mileage allowance"
fi: esim. "Ruokakulut", "Kahvia kiltahuoneelle" tai "Kilometrikorvaus"

source: e.g. "Fall sitz", "Freshmen meetup" or "Guildroom renovations"
fi: esim. "Syyssitsit", "Fuksiryhmätapaaminen" tai "Kiltahuoneen uudistaminen"

source: File size is too large. It should not exceed 9.5MB
fi: Tiedoston koko on liian iso. Maksimikoko on 9,5MB.

source: In process
fi: Käsittelyssä

source: Phone number
fi: Puhelinnumero

source: Account number (IBAN)
fi: Tilinumero (IBAN)

source: Total reimbursement (in €)
fi: Korvaussumma yhteensä (euroissa)

source: Additional information
fi: Lisätietoja, kulujen perusteita

source: reimbursement basic information
fi: kulukorvaus perustiedot

source: Reimbursement basic information
fi: Kulukorvaus perustiedot

source: Expense explanation
fi: Kulun selite

source: Event / expense target
fi: Tapahtuma / kulun kohde

source: Sum (in €)
fi: Summa (euroissa)

source: Receipt
fi: Kuitti

source: reimbursement
fi: kulukorvaus

source: Additional info
fi: Lisätietoja, kulujen perusteita

source: Your reimbursement claim has been received. The claim will be processed in the next Prodeko board meeting.
fi: Kulukorvauksesi on vastaanotettu. Hakemus käsitellään seuraavassa hallituksen kokouksessa.

source: If you notice any errors in the information below, contact Prodeko's treasurer immediately at rahastonhoitaja@prodeko.org.
fi: Jos havaitset virheitä alla olevissa tiedoista, ota välittömästi yhteys rahastonhoitajaan: rahastonhoitaja@prodeko.org.

source: Remove reimbursement
fi: Poista kulu

source: Reimbursement
fi: Kulukorvaukset

source: Basic information
fi: Perustiedot

source: Overall
fi: Yhteensä

source: Download as pdf
fi: Lataa pdf

source: ✅ Your reimbursement claim has been received. The claim will be processed in the next Prodeko board meeting. If you notice any errors in the information below, contact Prodeko's treasurer immediately at rahastonhoitaja@prodeko.org.
fi: ✅ Kulukorvauksesi on vastaanotettu. Hakemus käsitellään seuraavassa hallituksen kokouksessa. Jos havaitset virheitä pdf:n tiedoissa, ota välittömästi yhteys rahastonhoitajaan rahastonhoitaja@prodeko.org.

source: ⚠️ Something went wrong. Contact mediakeisari@prodeko.org to get the issue resolved.
fi: ️⚠️ Jotakin meni pieleen. Ota yhteyttä mediakeisari@prodeko.org ongelman selvittämiseksi.

source: Add reimbursement
fi: Lisää kulu

source: View
fi: Katsele

source: Accept
fi: Hyväksy

source: Reject
fi: Hylkää

source: Application actions
fi: Hakemustoimenpiteet

source: Membership applications
fi: Jäsenhakemukset

source: Apply for Prodeko membership application
fi: Sovellus - Prodekon jäsenhakemus

source: An application or account associated with this email already exists
fi: Jäsenhakemus tai käyttäjä tällä sähköpostiosoitteella on jo olemassa.

source: If you are studying at Aalto apply as a true member. Otherwise, apply as external member.
fi: Mikäli opiskelet Aalto-yliopistossa hae varsinaiseksi jäseneksi. Muuten hae ulkojäseneksi

source: Successfully added {} to {} mailing list.
fi: Lisätty {} onnistuneesti {} sähköpostilistalle.

source: Error adding a member to {}: {} is already a member.
fi: Virhe lisättäessä listalle {}: {} on jo listan jäsen.

source: Invalid credentials. Check documentation and validate setup in G Suite and GCP API console.
fi: Virheelliset tunnukset. Lue dokumentaatio uudestaan ja tarkista että G Suite sekä GCP API console on määritetty oikein.

source: True member
fi: Varsinainen jäsen

source: Alumn
fi: Alumni

source: External member
fi: Ulkojäsen

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Finnish
fi: Suomi

source: Other (English)
fi: Englanti

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: Hometown
fi: Kotikaupunki

source: Field of study
fi: Opiskeluala

source: Start year of studies
fi: Aloitusvuosi

source: Preferred language
fi: Kieli

source: Membership type
fi: Jäsentyyppi

source: Why do you want to become a member?
fi: Miksi haluat jäseneksi?

source: Are you an AYY (Aalto University Student Union) member?
fi: Oletko AYY:n jäsen?

source: I accept Prodeko's privacy policy
fi: Hyväksyn Prodekon tietosuojalausekkeen

source: Membership application accepted.
fi: Jäsenhakemus hyväksytty

source: Membership application rejected.
fi: Jäsenhakemus hylätty

source: membership application
fi: jäsenhakemus

source: Accept application
fi: Hyväksy hakemus

source: Reject application
fi: Hylkää hakemus

source: If you don't agree with Prodeko's privacy policy you can't use this online application form. Please contact Mediakeisari (mediakeisari@prodeko.org) if you still wish to apply to become a Prodeko member.
fi: Mikäli et hyväksy Prodekon tietosuojakäytäntöä, et voi käyttää jäsenhakemuslomaketta. Ota yhteyttä mediakeisariin (mediakeisari@prodeko.org) jos silti haluat hakea Prodekon jäseneksi.

source: 📬 Membership application received!
fi: 📬 Hakemus vastaanotettu!

source: Board meeting documents
fi: Hallituksen pöytäkirjat

source: Board meeting minutes application
fi: Sovellus - Hallituksen pöytäkirjat

source: No file starting with 'Pöytäkirja' found in folder {}
fi: Tiedostoa, jonka nimi alkaa 'Pöytäkirja' ei löytynyt kansiosta {}

source: Error downloading document: {} ({})
fi: Virhe pöytäkirjoja ladattaessa: {} ({})

source: Downloaded documents {} from G Drive.
fi: Ladattiin pöytäkirjat {} Drivestä

source: No documents downloaded.
fi: Yhtäkään pöytäkirjaa ei ladattu.

source: Error downloading documents: {}
fi: Virhe pöytäkirjoja ladattaessa: {}

source: minutes
fi: pöytäkirja

source: Minutes
fi: Pöytäkirjat

source: Download minutes from Drive
fi: Lataa pöytäkirjat Drivestä

source: How does this work
fi: Miten lataaminen toimii

source: Proleko's
fi: Prolekot

source: Proleko application
fi: Sovellus - Prolekot

source: Company name
fi: Yrityksen nimi

source: Image
fi: Kuva

source: Year
fi: Vuosi

source: Issue
fi: Numero

source: File
fi: Tiedosto

source: Thumbnail
fi: Esikatselukuva

source: Title
fi: Otsikko

source: Description
fi: Kuvaus

source: Author
fi: Toimittaja

source: Lead
fi: Ingressi

source: Content
fi: Sisältö

source: Liked by
fi: Tykännyt

source: post
fi: postaus

source: Posts
fi: Postaukset

source: Files
fi: Tiedostot

source: Files application
fi: Sovellus - Tiedostot

source: file version
fi: tiedostoversio

source: File versions
fi: Tiedostoversiot

source: Export selected as CSV
fi: Vie valitut CSV:hen

source: Board and guild officials
fi: Hallitus ja toimihenkilöt

source: Current guild officials application
fi: Sovellus - Nykyiset toimarit -sivu

source: Old guild officials application
fi: Sovellus - Vanhat toimarit -sivu

source: Current board of Prodeko application
fi: Sovellus - Nykyinen hallitus -sivu

source: Old boards of Prodeko application
fi: Sovellus - Vanhat hallitukset -sivu

source: section
fi: jaosto

source: sections
fi: jaostot

source: Position
fi: Virka

source: Section
fi: Jaosto

source: Photo
fi: Kuva

source: guild official
fi: toimari

source: guild officials
fi: toimarit

source: Position (English)
fi: Virka (Englanniksi)

source: Mobile phone
fi: Puhelinnumero

source: board member
fi: hallituksen jäsen

source: board members
fi: hallituksen jäsenet

source: Add %(name)s
fi: Lisää %(name)s

source: CSV imported successfully.
fi: CSV-tiedosto ladattu onnistuneesti

source: Error downloading CSV: {}
fi: Virhe csv:tä ladattaessa: {}

source: Utilities
fi: Työkalut

source: Elections
fi: Vaalit

source: Elections application
fi: Sovellus - Vaalit

source: Board
fi: Hallitus

source: Visible
fi: Näytä

source: Sort-key
fi: Järjestys-avain

source: Read by
fi: Lukenut

source: position
fi: virka

source: Positions
fi: Virat

source: Picture
fi: Kuva

source: applicant
fi: hakija

source: Applicants
fi: Hakijat

source: Question
fi: Kysymys

source: question
fi: kysymys

source: Questions
fi: Kysymykset

source: Answer
fi: Vastaus

source: answer
fi: vastaus

source: Answers
fi: Vastaukset

source: Submit answer
fi: Lähetä

source: Post an answer
fi: Vastaa

source: Introduction
fi: Esittely

source: Apply
fi: Hae virkaan

source: Note! You can modify your application later.
fi: Huom! Voit muokata hakemustasi myöhemmin.

source: Modify application
fi: Muokkaa hakemusta

source: Ask a question
fi: Lähetä kysymys

source: since
fi: sitten

source: No applicants
fi: Ei hakijoita

source: No questions
fi: Ei kysymyksiä

source: No Responses
fi: Ei vastauksia

source: Delete
fi: Poista

source: Modify
fi: Muokkaa

source: Read application
fi: Lue hakemus

source: Are you sure you want to remove your application?
fi: Haluatko varmasti poistaa hakemuksesi?

source: Close
fi: Sulje

source: Crop image
fi: Rajaa kuva

source: Crop
fi: Rajaa

source: Officials
fi: Toimarit

source: NEW
fi: UUSI

source: Remove
fi: Poista

source: Edit
fi: Muokkaa

source: English
fi: Englanti

source: Frontpage
fi: Etusivu

source: Content page
fi: Sisältösivu

source: Content page with 1:1 split
fi: Sisältösivu 1:1 jaolla

source: Content page with 2:1 split
fi: Sisältösivu 2:1 jaolla

source: Navigation
fi: Navigaatio

source: Django Administration
fi: Django - hallintapaneeli

source: Documentation
fi: Dokumentaatio

source: Log out
fi: Kirjaudu ulos

source: Open
fi: Avaa

source: Welcome to Aalto IEM
fi: Tervetuloa opiskelemaan Aallon tutalle

source: If you are a new student - click here!
fi: Klikkaa tästä uusien opiskelijoiden sivuille!

source: For prospective students
fi: Abeille

source: For guild members
fi: Kiltalaisille

source: For alumni
fi: Alumneille

source: For businesses
fi: Yrityksille

source: Contact information
fi: Ota yhteyttä

source: Mailing address
fi: Postiosoite

source: Visiting address
fi: Käyntiosoite

source: Apply for membership
fi: Jäsenhakemus

source: Social media
fi: Sosiaalinen media

source: Membership
fi: Hae jäsenyyttä

source: Are you sure to delete the application
fi: Haluatko varmasti poistaa hakemuksesi?

source: Cancel
fi: Peruuta

source: Client id
fi: Asiakastunnus

source: Client type
fi: Sisältösivu

source: Authorization Grant Type
fi: Valtuutustyypi

source: Redirect Uris
fi: Uudelleenohjaus uri:t

source: Go Back
fi: Takaisin

source: Edit application
fi: Muokkaa applikaatiota

source: Authorize
fi: Anna lupa

source: Application requires following permissions
fi: Applikaatio vaatii seuraavia oikeuksia

source: Are you sure to delete the token
fi: Haluatko varmasti poistaa tokenin?

source: 📝 You have not accepted Prodeko's privacy policy. Please accept our privacy policy in order to use the site while logged in.
fi: 📝 Et ole hyväksynyt Prodekon tietosuojalauseketta. Käyttääksesi sivustoa sinun on hyväksyttävä tietosuojalauseke.

source: Prodeko's data policies
fi: Prodekon tietosuoja

source: I agree
fi: Hyväksyn

source: I disagree
fi: En hyväksy

source: privacy policy
fi: tietosuojalausekkeemme

source: In order to use Prodeko's online services, you must agree to our
fi: Käyttääksesi Prodekon sähköisiä palveluita, sinun on hyväksyttävä

source: If you do not agree you will be logged out. Logging back in displays this dialog again.
fi: Mikäli et hyväksy tietosuojalauseketta, sinut kirjataan ulos. Kirjautumalla sisään näet tämän saman valintaikkunan.

source: Prodeko seminar
fi: Prodeko-seminaari

source: Prodeko seminar page
fi: Prodeko-seminaari sivu

source: Weekly bulletin
fi: Viikkotiedote

source: Weekly bulletin application
fi: Sovellus - Viikkotiedote

source: Header
fi: Otsikko

source: Category
fi: Kategoria

source: Tags
fi: Tagit

source: Start date
fi: Alkamispäivä

source: End date
fi: Päättymispäivä

source: Show deadline
fi: Näytä deadline

source: Bulletin updated
fi: Tiedote päivitetty

source: Order
fi: Järjestys

source: Visibility
fi: Näkyvyys

source: Public
fi: Julkinen

source: Login required
fi: Vaatii kirjautumisen

source: Add a new tag
fi: Lisää tagi

source: Add tag
fi: Lisää tagi

source: Host
fi: Palvelin

source: Port
fi: Portti

source: Username (email)
fi: Käyttäjänimi (sähköpostiosoite)

source: Use TLS Encryption
fi: TLS salaus päällä

source: Recipients (separated by comma)
fi: Vastaanottajat (pilkulla eroteltuna)

source: mail configuration
fi: mailikonfiguraatio

source: Mail configuration
fi: Mailikonfiguraatiot

source: tag
fi: tagi

source: category
fi: kategoria

source: Categories
fi: Kategoriat

source: bulletin
fi: tiedote

source: Bulletins
fi: Tiedotteet

source: Weekly Bulletin - Control Panel
fi: Tiedotteet - Hallintapaneeli

source: Edit categories
fi: Muokkaa kategorioita

source: Add a category
fi: Lisää kategoria

source: You can delete a category by leaving it empty and clicking Save
fi: Voit poistaa kategorian jättämällä sen tyhjäksi ja klikkaamalla Tallenna

source: Add
fi: Lisää

source: Save
fi: Tallenna

source: Publish
fi: Julkaise

source: Publish a new bulletin
fi: Tiedotteiden julkaisu

source: Latest bulletins
fi: Viimeisimmät julkaisut

source: Edit bulletins
fi: Muokkaa tiedotteita

source: Send email
fi: Lähetä sähköposti

source: Send a bulletin by email
fi: Lähetä tiedote sähköpostilla

source: Edit settings
fi: Muokkaa asetuksia

source: Email server settings
fi: Lähettävän palvelimen asetukset

source: User
fi: Käyttäjä

source: Preview
fi: Esikatselu

source: No results
fi: Ei tuloksia

source: All
fi: Kaikki

source: Hide
fi: Piilota

source: Show
fi: Näytä

source: Go to site
fi: Näytä sivusto

source: Now
fi: Nykyiset

source: Upcoming
fi: Tulevat

source: Old
fi: Menneet

source: Edit tags
fi: Muokkaa tageja

source: No tags
fi: Ei tageja

source: New bulletin added
fi: Tiedote lisätty
